# SupportNumber Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
HandRailType..::..SupportNumber Property
HandRailType Class See Also
---
The number of supports of the handrail.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public int SupportNumber { get; set; }
```

Visual Basic
---
```text
Public Property SupportNumber As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int SupportNumber {
	int get ();
	void set (int value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for supportNumber is negative. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | When setting this property: The rail has no support or the support layout is not fixed number so the data being set is not applicable. |

# See Also
HandRailType Class
Autodesk.Revit.DB.Architecture Namespace